

DHC Working Group                                               M. Stapp
Internet-Draft                                       Cisco Systems, Inc.
Expires: January 12, 2001                                  July 14, 2000


          Resolution of DNS Name Conflicts Among DHCP Clients
                <draft-ietf-dhc-ddns-resolution-00.txt>

Status of this Memo

   This document is an Internet-Draft and is in full conformance with
   all provisions of Section 10 of RFC2026.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF), its areas, and its working groups. Note that
   other groups may also distribute working documents as
   Internet-Drafts.

   Internet-Drafts are draft documents valid for a maximum of six
   months and may be updated, replaced, or obsoleted by other documents
   at any time. It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   The list of current Internet-Drafts can be accessed at
   http://www.ietf.org/ietf/1id-abstracts.txt.

   The list of Internet-Draft Shadow Directories can be accessed at
   http://www.ietf.org/shadow.html.

   This Internet-Draft will expire on January 12, 2001.

Copyright Notice

   Copyright (C) The Internet Society (2000). All Rights Reserved.

Abstract

   DHCP provides a powerful mechanism for IP host configuration.
   However, the configuration capability provided by DHCP does not
   include updating DNS(RFC1034[1], RFC1035[2]), and specifically
   updating the name to address and address to name mappings maintained
   in the DNS.

   The "Client FQDN Option"[14] specifies the client FQDN option,
   through which DHCP clients and servers can exchange information
   about client FQDNs.  This document describes techniques for the
   resolution of DNS name conflicts among DHCP clients.





Stapp                   Expires January 12, 2001                [Page 1]

Internet-Draft        Resolution of Name Conflicts             July 2000


Table of Contents

   1.    Terminology  . . . . . . . . . . . . . . . . . . . . . . . .  3
   2.    Introduction . . . . . . . . . . . . . . . . . . . . . . . .  3
   3.    Issues with DDNS in DHCP Environments  . . . . . . . . . . .  3
   3.1   Name Conflicts . . . . . . . . . . . . . . . . . . . . . . .  3
   3.2   Multiple DHCP servers  . . . . . . . . . . . . . . . . . . .  4
   3.3   Use of the DHCID RR  . . . . . . . . . . . . . . . . . . . .  5
   3.3.1 Format of the DHCID RRDATA . . . . . . . . . . . . . . . . .  5
   3.4   DNS RR TTLs  . . . . . . . . . . . . . . . . . . . . . . . .  7
   4.    Procedures for performing DNS updates  . . . . . . . . . . .  7
   4.1   Adding A RRs to DNS  . . . . . . . . . . . . . . . . . . . .  7
   4.2   Adding PTR RR Entries to DNS . . . . . . . . . . . . . . . .  8
   4.3   Removing Entries from DNS  . . . . . . . . . . . . . . . . .  8
   4.4   Updating other RRs . . . . . . . . . . . . . . . . . . . . .  9
   5.    Security Considerations  . . . . . . . . . . . . . . . . . .  9
   6.    Acknowledgements . . . . . . . . . . . . . . . . . . . . . . 10
         References . . . . . . . . . . . . . . . . . . . . . . . . . 10
         Author's Address . . . . . . . . . . . . . . . . . . . . . . 11
         Full Copyright Statement . . . . . . . . . . . . . . . . . . 12































Stapp                   Expires January 12, 2001                [Page 2]

Internet-Draft        Resolution of Name Conflicts             July 2000


1. Terminology

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in RFC 2119[6].

2. Introduction

   "The Client FQDN Option"[14] includes a description of the operation
   of DHCP[3] clients and servers that use the client FQDN option. 
   Through the use of the client FQDN option, DHCP clients and servers
   can negotiate the client's FQDN and the allocation of responsibility
   for updating the DHCP client's A RR record.  This document
   identifies situations in which conflicts in the use of FQDNs may
   arise among DHCP clients, and describes a strategy for the use of
   the DHCID DNS resource record[12] in resolving those conflicts.

3. Issues with DDNS in DHCP Environments

   There are two DNS update situations that require special
   consideration in DHCP environments: cases where more than one DHCP
   client has been configured with the same FQDN, and cases where more
   than one DHCP server has been given authority to perform DNS updates
   in a zone. In these cases, it is possible for DNS records to be
   modified in inconsistent ways unless the updaters have a mechanism
   that allows them to detect anomolous situations. If DNS updaters can
   detect these situations, site administrators can configure the
   updaters' behavior so that the site's policies can be enforced. We
   use the term "Name Conflict" to refer to cases where more than one
   DHCP client has been associated with a single FQDN. This
   specification describes a mechanism designed to allow updaters to
   detect these situations, and requires that DHCP implementations use
   this mechanism by default.

3.1 Name Conflicts

   How can the entity updating an A RR (either the DHCP client or DHCP
   server) detect that a domain name has an A RR which is already in
   use by a different DHCP client? Similarly, should a DHCP client or
   server update a domain name which has an A RR that has been
   configured by an administrator?  In either of these cases, the
   domain name in question would either have an additional A RR, or
   would have its original A RR replaced by the new record. Either of
   these effects may be considered undesirable by some sites. Different
   authority and credential models have different levels of exposure to
   name conflicts. 

   1.  Client updates A RR, uses Secure DNS Update with credentials
       that are associated with the client's FQDN, and exclusive to the


Stapp                   Expires January 12, 2001                [Page 3]

Internet-Draft        Resolution of Name Conflicts             July 2000


       client. Name conflicts in this scenario are unlikely (though not
       impossible), since the client has received credentials specific
       to the name it desires to use.  This implies that the name has
       already been allocated (through some implementation- or
       organization-specific procedure) to that client.

   2.  Client updates A RR, uses Secure DNS Update with credentials
       that are valid for any name in the zone. Name conflicts in this
       scenario are possible, since the credentials necessary for the
       client to update DNS are not necessarily name-specific.  Thus,
       for the client to be attempting to update a unique name requires
       the existence of some administrative procedure to ensure client
       configuration with unique names.

   3.  Server updates the A RR, uses a name for the client which is
       known to the server. Name conflicts in this scenario are likely
       unless prevented by the server's name configuration procedures.
       See Section 5 for security issues with this form of deployment.

   4.  Server updates the A RR, uses a name supplied by the client.
       Name conflicts in this scenario are highly likely, even with
       administrative procedures designed to prevent them.  (This
       scenario is a popular one in real-world deployments in many
       types of organizations.)  See Section 5 for security issues with
       this type of deployment.


   Scenarios 2, 3, and 4 rely on administrative procedures to ensure
   name uniqueness for DNS updates, and these procedures may break
   down. Experience has shown that, in fact, these procedures will
   break down at least occasionally.  The question is what to do when
   these procedures break down or, for example in scenario #4, may not
   even exist.

   In all cases of name conflicts, the desire is to offer two modes of
   operation to the administrator of the combined DHCP-DNS capability:
   first-update-wins (i.e., the first updating entity gets the name) or
   most-recent-update-wins (i.e., the last updating entity for a name
   gets the name).

3.2 Multiple DHCP servers

   If multiple DHCP servers are able to update the same DNS zones, or
   if DHCP servers are performing A RR updates on behalf of DHCP
   clients, and more than one DHCP server may be able to serve
   addresses to the same DHCP clients, the DHCP servers should be able
   to provide reasonable and consistent DNS name update behavior for
   DHCP clients.



Stapp                   Expires January 12, 2001                [Page 4]

Internet-Draft        Resolution of Name Conflicts             July 2000


3.3 Use of the DHCID RR

   A solution to both of these problems is for the updating entities
   (both DHCP clients and DHCP servers) to be able to detect that
   another entity has been associated with a DNS name, and to offer
   administrators the opportunity to configure update behavior.

   Specifically, a DHCID RR, described in DHCID RR[12] is used to
   associate client identification information with a DNS name and the
   A RR associated with that name.  When either a client or server adds
   an A RR for a client, it also adds a DHCID RR which specifies a
   unique client identity (based on a "client specifier" created from
   the client's client-id or MAC address).  In this model, only one A
   RR is associated with a given DNS name at a time.

   By associating this ownership information with each A RR,
   cooperating DNS updating entities may determine whether their client
   is the first or last updater of the name (and implement the
   appropriately configured administrative policy), and DHCP clients
   which currently have a host name may move from one DHCP server to
   another without losing their DNS name.

   The specific algorithms utilizing the DHCID RR to signal client
   ownership are explained below.  The algorithms only work in the case
   where the updating entities all cooperate -- this approach is
   advisory only and is not substitute for DNS security, nor is it
   replaced by DNS security.

3.3.1 Format of the DHCID RRDATA

   The DHCID RR used to hold the DHCP client's identity is formatted as
   follows:

   The name of the DHCID RR is the name of the A or PTR RR which refers
   to the DHCP client.

   The RDATA section of a DHCID RR in transmission contains RDLENGTH
   bytes of binary data. From the perspective of DHCP clients and
   servers, the DHC resource record consists of a 16-bit identifier
   type, followed by one or more bytes representing the actual
   identifier. There are two possible forms for a DHCID RR - one that
   is used when the client's link-layer address is being used to
   identify it, and one that is used when some DHCP option that the
   DHCP client has sent is being used to identify it.
      

      DISCUSSION:
      Implementors should note that the actual identifying data is
      never placed into the DNS directly. Instead, the client-identity


Stapp                   Expires January 12, 2001                [Page 5]

Internet-Draft        Resolution of Name Conflicts             July 2000


      data is used as the input into a one-way hash algorithm, and the
      output of that hash is then used as DNS RRDATA. This has been
      specified in order to avoid placing data about DHCP clients that
      some sites might consider sensitive into the DNS.

   When the updater is using the client's link-layer address, the first
   two bytes of the DHCID RRDATA MUST be zero. To generate the rest of
   the resource record, the updater MUST compute a one-way hash using
   the MD5[13] algorithm across a buffer containing the client's
   network hardware type and link-layer address. Specifically, the
   first byte of the buffer contains the network hardware type as it
   appears in the DHCP htype field of the client's DHCPREQUEST message.
   All of the significant bytes of the chaddr field in the client's
   DHCPREQUEST message follow, in the same order in which the bytes
   appear in the DHCPREQUEST message. The number of significant bytes
   in the chaddr field is specified in the hlen field of the
   DHCPREQUEST message.

   When the updater is using a DHCP option sent by the client in its
   DHCPREQUEST message, the first two bytes of the DHCID RR MUST be the
   option code of that option, in network byte order. For example, if
   the DHCP client identifier option is being used, the first byte of
   the DHCID RR should be zero, and the second byte should be 61
   decimal. The rest of the DHCID RR MUST contain the results of
   computing a one-way hash across the payload of the option being
   used, using the MD5 algorithm. The payload of a DHCP option consists
   of the bytes of the option following the option code and length.

   The two byte identifier code 0xffff is reserved for future
   assignment.

   In order for independent DHCP implementations to be able to use the
   DHCID RR as a prerequisite in dynamic DNS updates, each updater must
   be able to reliably choose the same identifier that any other would
   choose.  To make this possible, we specify a prioritization which
   will ensure that for any given DHCP client request, any updater will
   select the same client-identity data.  All updaters MUST use this
   order of prioritization by default, but all implementations SHOULD
   be configurable to use a different prioritization if so desired by
   the site administrators.  Because of the possibility of future
   changes in the DHCP protocol, implementors SHOULD check for updated
   versions of this draft when implementing new DHCP clients and
   servers which can perform DDNS updates, and also when releasing new
   versions of existing clients and servers.

   DHCP clients and servers should use the following forms of client
   identification, starting with the most preferable, and finishing
   with the least preferable.  If the client does not send any of these
   forms of identification, the DHCP/DDNS interaction is not defined by


Stapp                   Expires January 12, 2001                [Page 6]

Internet-Draft        Resolution of Name Conflicts             July 2000


   this specification.  The most preferable form of identification is
   the Globally Unique Identifier Option [TBD].  Next is the DHCP
   Client Identifier option.  Last is the client's link-layer address,
   as conveyed in its DHCPREQUEST message.  Implementors should note
   that the link-layer address cannot be used if there are no
   significant bytes in the chaddr field of the DHCP client's request,
   because this does not constitute a unique identifier.

3.4 DNS RR TTLs

   RRs associated with DHCP clients may be more volatile than
   statically configured RRs. DHCP clients and servers which perform
   dynamic updates should attempt to specify resource record TTLs which
   reflect this volatility, in order to minimize the possibility that
   there will be stale records in resolvers' caches. A reasonable basis
   for RR TTLs is the lease duration itself: TTLs of 1/2 or 1/3 the
   expected lease duration might be reasonable defaults. Because
   configured DHCP lease times vary widely from site to site, it may
   also be desirable to establish a fixed TTL ceiling. DHCP clients and
   servers MAY allow administrators to configure the TTLs they will
   supply, possibly as a fraction of the actual lease time, or as a
   fixed value.

4. Procedures for performing DNS updates

4.1 Adding A RRs to DNS

   When a DHCP client or server intends to update an A RR, it first
   prepares a DNS UPDATE query which includes as a prerequisite the
   assertion that the name does not exist.  The update section of the
   query attempts to add the new name and its IP address mapping (an A
   RR), and the DHCID RR with its unique client-identity.

   If this update operation succeeds, the updater can conclude that it
   has added a new name whose only RRs are the A and DHCID RR records.
   The A RR update is now complete (and a client updater is finished,
   while a server might proceed to perform a PTR RR update).

   If the first update operation fails with YXDOMAIN, the updater can
   conclude that the intended name is in use.  The updater then
   attempts to confirm that the DNS name is not being used by some
   other host. The updater prepares a second UPDATE query in which the
   prerequisite is that the desired name has attached to it a DHCID RR
   whose contents match the client identity.  The update section of
   this query deletes the existing A records on the name, and adds the
   A record that matches the DHCP binding and the DHCID RR with the
   client identity.

   If this query succeeds, the updater can conclude that the current


Stapp                   Expires January 12, 2001                [Page 7]

Internet-Draft        Resolution of Name Conflicts             July 2000


   client was the last client associated with the domain name, and that
   the name now contains the updated A RR. The A RR update is now
   complete (and a client updater is finished, while a server would
   then proceed to perform a PTR RR update).

   If the second query fails with NXRRSET, the updater must conclude
   that the client's desired name is in use by another host.  At this
   juncture, the updater can decide (based on some administrative
   configuration outside of the scope of this document) whether to let
   the existing owner of the name keep that name, and to (possibly)
   perform some name disambiguation operation on behalf of the current
   client, or to replace the RRs on the name with RRs that represent
   the current client. If the configured policy allows replacement of
   existing records, the updater submits a query that deletes the
   existing A RR and the existing DHCID RR, adding A and DHCID RRs that
   represent the IP address and client-identity of the new client.
      

      DISCUSSION:
      The updating entity may be configured to allow the existing DNS
      records on the domain name to remain unchanged, and to perform
      disambiguation on the name of the current client in order to
      attempt to generate a similar but unique name for the current
      client. In this case, once another candidate name has been
      generated, the updater should restart the process of adding an A
      RR as specified in this section.

4.2 Adding PTR RR Entries to DNS

   The DHCP server submits a DNS query which deletes all of the PTR RRs
   associated with the lease IP address, and adds a PTR RR whose data
   is the client's (possibly disambiguated) host name. The server also
   adds a DHCID RR specified in Section 3.3.

4.3 Removing Entries from DNS

   The most important consideration in removing DNS entries is be sure
   that an entity removing a DNS entry is only removing an entry that
   it added, or for which an administrator has explicitly assigned it
   responsibility.

   When a lease expires or a DHCP client issues a DHCPRELEASE request,
   the DHCP server SHOULD delete the PTR RR that matches the DHCP
   binding, if one was successfully added. The server's update query
   SHOULD assert that the name in the PTR record matches the name of
   the client whose lease has expired or been released.

   The entity chosen to handle the A record for this client (either the
   client or the server) SHOULD delete the A record that was added when


Stapp                   Expires January 12, 2001                [Page 8]

Internet-Draft        Resolution of Name Conflicts             July 2000


   the lease was made to the client.

   In order to perform this delete, the updater prepares an UPDATE
   query which contains two prerequisites.  The first prerequisite
   asserts that the DHCID RR exists whose data is the client identity
   described in Section 3.3. The second prerequisite asserts that the
   data in the A RR contains the IP address of the lease that has
   expired or been released.

   If the query fails, the updater MUST NOT delete the DNS name.  It
   may be that the host whose lease on the server has expired has moved
   to another network and obtained a lease from a different server,
   which has caused the client's A RR to be replaced. It may also be
   that some other client has been configured with a name that matches
   the name of the DHCP client, and the policy was that the last client
   to specify the name would get the name.  In this case, the DHCID RR
   will no longer match the updater's notion of the client-identity of
   the host pointed to by the DNS name.

4.4 Updating other RRs

   The procedures described in this document only cover updates to the
   A and PTR RRs. Updating other types of RRs is outside the scope of
   this document.

5. Security Considerations

   Unauthenticated updates to the DNS can lead to tremendous confusion,
   through malicious attack or through inadvertent misconfiguration.
   Administrators should be wary of permitting unsecured DNS updates to
   zones which are exposed to the global Internet. Both DHCP clients
   and servers SHOULD use some form of update request origin
   authentication procedure (e.g., Simple Secure DNS Update[11]) when
   performing DNS updates.

   Whether a DHCP client may be responsible for updating an FQDN to IP
   address mapping, or whether this is the responsibility of the DHCP
   server is a site-local matter. The choice between the two
   alternatives may be based on the security model that is used with
   the Dynamic DNS Update protocol (e.g., only a client may have
   sufficient credentials to perform updates to the FQDN to IP address
   mapping for its FQDN).

   Whether a DHCP server is always responsible for updating the FQDN to
   IP address mapping (in addition to updating the IP to FQDN mapping),
   regardless of the wishes of an individual DHCP client, is also a
   site-local matter. The choice between the two alternatives may be
   based on the security model that is being used with dynamic DNS
   updates. In cases where a DHCP server is performing DNS updates on


Stapp                   Expires January 12, 2001                [Page 9]

Internet-Draft        Resolution of Name Conflicts             July 2000


   behalf of a client, the DHCP server should be sure of the DNS name
   to use for the client, and of the identity of the client.

   Currently, it is difficult for DHCP servers to develop much
   confidence in the identities of its clients, given the absence of
   entity authentication from the DHCP protocol itself. There are many
   ways for a DHCP server to develop a DNS name to use for a client,
   but only in certain relatively unusual circumstances will the DHCP
   server know for certain the identity of the client. If DHCP
   Authentication[10] becomes widely deployed this may become more
   customary.

   One example of a situation which offers some extra assurances is one
   where the DHCP client is connected to a network through an MCNS
   cable modem, and the CMTS (head-end) of the cable modem ensures that
   MAC address spoofing simply does not occur. Another example of a
   configuration that might be trusted is one where clients obtain
   network access via a network access server using PPP. The NAS itself
   might be obtaining IP addresses via DHCP, encoding a client
   identification into the DHCP client-id option.  In this case, the
   network access server as well as the DHCP server might be operating
   within a trusted environment, in which case the DHCP server could be
   configured to trust that the user authentication and authorization
   procedure of the remote access server was sufficient, and would
   therefore trust the client identification encoded within the DHCP
   client-id.

6. Acknowledgements

   Many thanks to Mark Beyer, Jim Bound, Ralph Droms, Robert Elz, Peter
   Ford, Edie Gunter, Andreas Gustafsson, R. Barr Hibbs, Kim Kinnear,
   Stuart Kwan, Ted Lemon, Ed Lewis, Michael Lewis, Josh Littlefield,
   Michael Patton, and Glenn Stump for their review and comments.

References

   [1]   Mockapetris, P., "Domain names - Concepts and Facilities", RFC
         1034, Nov 1987.

   [2]   Mockapetris, P., "Domain names - Implementation and
         Specification", RFC 1035, Nov 1987.

   [3]   Droms, R., "Dynamic Host Configuration Protocol", RFC 2131,
         March 1997.

   [4]   Marine, A., Reynolds, J. and G. Malkin, "FYI on Questions and
         Answers to Commonly asked ``New Internet User'' Questions",
         RFC 1594, March 1994.



Stapp                   Expires January 12, 2001               [Page 10]

Internet-Draft        Resolution of Name Conflicts             July 2000


   [5]   Vixie, P., Thomson, S., Rekhter, Y. and J. Bound, "Dynamic
         Updates in the Domain Name System", RFC 2136, April 1997.

   [6]   Bradner, S., "Key words for use in RFCs to Indicate
         Requirement Levels", RFC 2119, March 1997.

   [7]   Eastlake, D., "Domain Name System Security Extensions", RFC
         2535, March 1999.

   [8]   Vixie, P., "Extension Mechanisms for DNS (EDNS0)", RFC 2671,
         August 1999.

   [9]   Vixie, P., Gudmundsson, O., Eastlake, D. and B. Wellington,
         "Secret Key Transaction Authentication for DNS (TSIG)
         (draft-ietf-dnsext-tsig-*)", July 1999.

   [10]  Droms, R. and W. Arbaugh, "Authentication for DHCP Messages
         (draft-ietf-dhc-authentication-*)", June 1999.

   [11]  Wellington, B., "Simple Secure DNS Dynamic Updates
         (draft-ietf-dnsext-simple-secure-update-*)", June 1999.

   [12]  Stapp, M., Gustafsson, A. and T. Lemon, "A DNS RR for Encoding
         DHCP Information (draft-ietf-dnsext-dhcid-rr-*)", July 2000.

   [13]  Rivest, R., "The MD5 Message Digest Algorithm", RFC 1321,
         April 1992.

   [14]  Stapp, M. and Y. Rekhter, "The DHCP Client FQDN Option
         (draft-ietf-dhc-fqdn-option-*.txt)", July 2000.


Author's Address

   Mark Stapp
   Cisco Systems, Inc.
   250 Apollo Dr.
   Chelmsford, MA  01824
   US

   Phone: 978.244.8498
   EMail: mjs@cisco.com









Stapp                   Expires January 12, 2001               [Page 11]

Internet-Draft        Resolution of Name Conflicts             July 2000


Full Copyright Statement

   Copyright (C) The Internet Society (2000). All Rights Reserved.

   This document and translations of it may be copied and furnished to
   others, and derivative works that comment on or otherwise explain it
   or assist in its implementation may be prepared, copied, published
   and distributed, in whole or in part, without restriction of any
   kind, provided that the above copyright notice and this paragraph
   are included on all such copies and derivative works. However, this
   document itself may not be modified in any way, such as by removing
   the copyright notice or references to the Internet Society or other
   Internet organizations, except as needed for the purpose of
   developing Internet standards in which case the procedures for
   copyrights defined in the Internet Standards process must be
   followed, or as required to translate it into languages other than
   English.

   The limited permissions granted above are perpetual and will not be
   revoked by the Internet Society or its successors or assigns.

   This document and the information contained herein is provided on an
   "AS IS" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING
   TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING
   BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION
   HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF
   MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.

Acknowledgement

   Funding for the RFC editor function is currently provided by the
   Internet Society.



















Stapp                   Expires January 12, 2001               [Page 12]

